In [17]:
import pandas as pd
import numpy as np
from pydataset import data

In [18]:
data('mpg', show_doc = True)

mpg

PyDataset Documentation (adopted from R Documentation. The displayed examples are in R)

## Fuel economy data from 1999 and 2008 for 38 popular models of car

### Description

This dataset contains a subset of the fuel economy data that the EPA makes
available on http://fueleconomy.gov. It contains only models which had a new
release every year between 1999 and 2008 - this was used as a proxy for the
popularity of the car.

### Usage

    data(mpg)

### Format

A data frame with 234 rows and 11 variables

### Details

  * manufacturer.

  * model.

  * displ. engine displacement, in litres

  * year.

  * cyl. number of cylinders

  * trans. type of transmission

  * drv. f = front-wheel drive, r = rear wheel drive, 4 = 4wd

  * cty. city miles per gallon

  * hwy. highway miles per gallon

  * fl.

  * class.

In [19]:
# Load the mpg dataset. Read the documentation for it, and use the data to answer these questions:

mpg = data('mpg')
mpg

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact
...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize

In [4]:
# On average, which manufacturer has the best miles per gallon?
cty_mpg = mpg.groupby('manufacturer').cty.mean()
hwy_mpg = mpg.groupby('manufacturer').hwy.mean()
mpg['combine'] = (mpg.cty + mpg.hwy)/2
combine_mpg = mpg.groupby('manufacturer').combine.mean()
combine_mpg[combine_mpg.max() == combine_mpg]
# # Do automatic or manual cars have better miles per gallon?

manufacturer
honda    28.5
Name: combine, dtype: float64

In [5]:
# How many different manufacturers are there?
len(mpg.manufacturer.unique())

15

In [6]:
# How many different models are there?
len(mpg.model.unique())
unique_model = mpg.model.unique()
unique_model.size

38

In [7]:
# # Do automatic or manual cars have better miles per gallon?
trans_avg = mpg.groupby('trans').combine.agg(['count', 'mean'])
trans_avg.index.str.split("(")

Index([  ['auto', 'av)'],   ['auto', 'l3)'],   ['auto', 'l4)'],
         ['auto', 'l5)'],   ['auto', 'l6)'],   ['auto', 's4)'],
         ['auto', 's5)'],   ['auto', 's6)'], ['manual', 'm5)'],
       ['manual', 'm6)']],
      dtype='object', name='trans')

In [8]:
from env import host, user, password
db_name = "employees"
url = f"mysql+pymysql://{user}:{password}@{host}/{db_name}"

In [9]:
users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})
users

   id   name  role_id
0   1    bob      1.0
1   2    joe      2.0
2   3  sally      3.0
3   4   adam      3.0
4   5   jane      NaN
5   6   mike      NaN

In [10]:
roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})
roles

   id       name
0   1      admin
1   2     author
2   3   reviewer
3   4  commenter

In [11]:
# Copy the users and roles dataframes from the examples above. 
# What do you think a right join would look like? An outer join? 
# What happens if you drop the foreign keys from the dataframes and try to merge them?
pd.merge(users, roles, left_on='role_id', right_on='id', how='left')

   id_x name_x  role_id  id_y    name_y
0     1    bob      1.0   1.0     admin
1     2    joe      2.0   2.0    author
2     3  sally      3.0   3.0  reviewer
3     4   adam      3.0   3.0  reviewer
4     5   jane      NaN   NaN       NaN
5     6   mike      NaN   NaN       NaN

In [12]:
pd.merge(users, roles, left_on='role_id', right_on='id', how='outer')

   id_x name_x  role_id  id_y     name_y
0   1.0    bob      1.0   1.0      admin
1   2.0    joe      2.0   2.0     author
2   3.0  sally      3.0   3.0   reviewer
3   4.0   adam      3.0   3.0   reviewer
4   5.0   jane      NaN   NaN        NaN
5   6.0   mike      NaN   NaN        NaN
6   NaN    NaN      NaN   4.0  commenter

In [13]:
pd.merge(users, roles, left_on='role_id', right_on='id', how='right')

   id_x name_x  role_id  id_y     name_y
0   1.0    bob      1.0     1      admin
1   2.0    joe      2.0     2     author
2   3.0  sally      3.0     3   reviewer
3   4.0   adam      3.0     3   reviewer
4   NaN    NaN      NaN     4  commenter

In [14]:
# Getting data from SQL databases

# Create a function named get_db_url. It should accept a username, hostname, password, 
# and database name and return a url formatted like in the examples in this lesson.

db_name = "employees"

def get_db_url(db_name):
    from env import host, user, password
    url = f"mysql+pymysql://{user}:{password}@{host}/{db_name}"
    return pd.read_sql("SELECT * FROM employees", url)


# Use your function to obtain a connection to the employees database.

get_db_url(db_name)

# Once you have successfully run a query:
# Intentionally make a typo in the database url. What kind of error message do you see?

NoSuchModuleError: Can't load plugin: sqlalchemy.dialects:mysql.pmysql

# Intentionally make an error in your SQL query. What does the error message look like?
pd.read_sql("SELECT * FROM emplooyes", url)
SyntaxError: EOL while scanning string literal

SyntaxError: EOL while scanning string literal (<ipython-input-14-e562a8ea1f5d>, line 21)

In [20]:
def get_db_url(db_name):
    from env import host, user, password
    url = f"mysql+pymysql://{user}:{password}@{host}/{db_name}"
    return pd.read_sql("SELECT * FROM employees", url)

In [21]:
# Read the employees and titles tables into two separate dataframes
employees = pd.read_sql("SELECT * FROM employees", url)
titles = pd.read_sql("SELECT * FROM titles", url)
titles

        emp_no            title   from_date     to_date
0        10001  Senior Engineer  1986-06-26  9999-01-01
1        10002            Staff  1996-08-03  9999-01-01
2        10003  Senior Engineer  1995-12-03  9999-01-01
3        10004         Engineer  1986-12-01  1995-12-01
4        10004  Senior Engineer  1995-12-01  9999-01-01
...        ...              ...         ...         ...
443303  499997         Engineer  1987-08-30  1992-08-29
443304  499997  Senior Engineer  1992-08-29  9999-01-01
443305  499998     Senior Staff  1998-12-27  9999-01-01
443306  499998            Staff  1993-12-27  1998-12-27
443307  499999         Engineer  1997-11-30  9999-01-01

[443308 rows x 4 columns]

In [22]:
# Visualize the number of employees with each title.
titles.groupby('title').emp_no.count()
titles[titles.to_date == titles.to_date.max()].groupby('title').emp_no.count()
# Visualize how frequently employees change titles.
# For each title, find the hire date of the employee that was hired most recently with that title.
# Write the code necessary to create a cross tabulation of the number of titles by department. (Hint: this will involve a combination of SQL and python/pandas code)

title
Assistant Engineer     3588
Engineer              30983
Manager                   9
Senior Engineer       85939
Senior Staff          82024
Staff                 25526
Technique Leader      12055
Name: emp_no, dtype: int64

In [23]:
# Join the employees and titles dataframes together.
merged = pd.merge(employees, titles, left_on='emp_no', right_on='emp_no', how='outer')
merged.head(5)

,emp_no,birth_date,first_name,last_name,gender,hire_date,title,from_date,to_date
0,10001,1953-09-02,Georgi,Facello,M,1986-06-26,Senior Engineer,1986-06-26,9999-01-01
1,10002,1964-06-02,Bezalel,Simmel,F,1985-11-21,Staff,1996-08-03,9999-01-01
2,10003,1959-12-03,Parto,Bamford,M,1986-08-28,Senior Engineer,1995-12-03,9999-01-01
3,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,Engineer,1986-12-01,1995-12-01
4,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,Senior Engineer,1995-12-01,9999-01-01

In [ ]:
# Visualize how frequently employees change titles.
import matplotlib as plt
#Find the highest date that isn't 9999 (datetime.date(2002, 8, 1))
change_date = titles.to_date[titles.to_date != titles.to_date.max()].max()
# Change all 9999 dates to 
map_titles = titles.to_date.apply(lambda n: change_date if n == titles.to_date.max() else n)
map_titles.head()

In [ ]:
titles.to_date[titles.to_date != titles.to_date.max()].max()

In [ ]:
# For each title, find the hire date of the employee that was hired most recently with that title.
titles.groupby('title').from_date.max()

In [ ]:
# Write the code necessary to create a cross tabulation of the number of titles by department. (Hint: this will involve a combination of SQL and python/pandas code)
department = pd.read_sql("SELECT * FROM departments JOIN dept_emp USING(dept_no)", url)
title_dep_merge = pd.merge(department, titles, left_on='emp_no', right_on='emp_no', how='left')
title_dep_merge.head(5)
pd.crosstab(title_dep_merge.dept_name, title_dep_merge.title)